{
  "social": {
    "email": "tajwarr.cs@gmail.com",
    "linkedin": "https://www.linkedin.com/in/tajwarrahman/",
    "github": "https://github.com/thetajwar2003"
  },
  "skills": [
    {
      "name": "Python",
      "desc": "Machine Learning, Data Science, Regression, Classification, Clustering, Django, Selenium"
    },
    {
      "name": "Java",
      "desc": "Object-Oriented, JDBC, Lambdas, Data Structures, Algorithms, Spring Boot"
    },
    {
      "name": "React/Next.js",
      "desc": "JavaScript, TypeScript, Node.js, Full Stack"
    },
    {
      "name": "Cloud Technologies",
      "desc": "AWS (Cloud Practitioner), GCP, Azure, MongoDB"
    },
    {
      "name": "SwiftUI",
      "desc": "APIs, CreateML, CoreData, UI/UX Design"
    },
    {
      "name": "Databases",
      "desc": "No-SQL, MySQL, SQLite, MSSQL, PostgreSQL, MongoDB"
    },
    {
      "name": "Other Languages",
      "desc": "Go, C#/C++, GraphQL, HTML, CSS"
    },
    {
      "name": "Other Softwares/Frameworks",
      "desc": "Git, Docker, Kubernetes"
    }
  ],
  "experiences": [
    {
      "company": "MetLife",
      "position": "Software Engineer Intern",
      "desc": [
        "• Delivered an end-to-end subset of components and services migrated from AngularJS to Angular 13, reducing latency by 40%",
        "• Optimized build/release pipelines in Azure DevOps to automate deployments using power shell scripts, decreasing the deployment lead time by 2-3 minutes",
        "• Designed an automated onboarding process for new hires that minimizes hiring costs by over $300K"
      ],
      "type": "Internship/Co-Op",
      "date": "May 2022 - Present"
    },
    {
      "company": "The Headstarter",
      "position": "Tech Lead",
      "desc": [
        "• Partnered with CTO to redesign the backend architecture by shifting from an express to a serverless framework, reducing monthly AWS resource costs by 80%",
        "• Led the refactoring of the old code base to Next.js and implementation of AWS CDK to improve performance by 60%",
        "• Introduced caching such as CloudFront in media related content to decrease video loading time by 66%",
        "• Discussed and verified project progress with beta users and external stakeholders by collecting feedback on different stages and directly addressing concerns",
        "• Successfully launched the platform, gaining over 500 users and earning over $20K in revenue"
      ],
      "type": "Part-Time",
      "date": "March 2022 - Present"
    },
    {
      "company": "The Headstarter",
      "position": "Founding Engineer",
      "desc": [
        "• Built video platform in 45 days for startup’s launch in October, which had 40+ users, using React, Express, and AWS",
        "• Created custom React components, reducing the number of clicks and the time on pages for the average user by 8%",
        "• Utilized AWS services such as Cognito, EC2, S3, SES, CloudFormation, Lambda, and DynamoDB by working alongside the backend team, which increased productivity by 30%",
        "• Spearheaded a paywall and subscription management system using Stripe that’s able to handle about 15K users/month",
        "• Worked closely with 5+ senior engineers and cofounders on code quality feedback and best coding practices"
      ],
      "type": "Part-Time",
      "date": "Aug 2021 - March 2022"
    },
    {
      "company": "Slingshot",
      "position": "Software Engineer Intern",
      "desc": [
        "• Engineered an automation portal using TypeScript and React to increase productivity by providing mentors and interns the means to manage the planning, development, and execution of their startups",
        "• Revised, modularized, and updated old code bases to modern development standards, making the portal 90% faster",
        "• Integrated Firebase cloud functions which automated tasks, created repositories, sent emails, and created folders using the Trello, GitHub, Gmail, and Google Drive APIs",
        "• Collaborated with the CEO and CTO to deploy the portal and improve search engine optimization (SEO)"
      ],
      "type": "Internship",
      "date": "Oct 2020 -  May 2021"
    },
    {
      "company": "Slingshot",
      "position": "Machine Learning Research Intern",
      "desc": [
        "• Worked to increase personal device security by providing continuous than one-time authentication to the user",
        "• Achieved 97% accuracy on novel ML text classifying models created to uniquely identify users based on their stylometric features",
        "• Developed a cross-platform app using React-Native and Firebase to collect stylometric data on which research was conducted and models were trained"
      ],
      "type": "Internship",
      "date": "Jul 2020 - Oct 2020"
    }
  ],
  "projects": [
    {
      "name": "Dad Joke CLI",
      "date": "11/2021",
      "meta": "Developed a CLI using Go and Cobra that prints out random dad jokes using a “random” command and a “--term” flag. Fetched data from the icanhazdadjoke API using a get request.",
      "tags": "GoLang ∙ Cobra",
      "link": "https://github.com/thetajwar2003/dadjoke"
    },
    {
      "name": "AWS Bookstore",
      "date": "11/2021",
      "meta": "Built a simple bookstore website where users can view, buy, and sell books using React. Integrated Stripe API and AWS services (Cognito, S3, Lambda, CloudFormation) to handle checkout and user actions.",
      "tags": "React ∙ AWS ∙ Stripe",
      "link": "https://github.com/thetajwar2003/AWSBookstore"
    },
    {
      "name": "CodeMatch",
      "date": "9/2021",
      "meta": "Worked with a team of 7 to build a platform to connect established software engineers with college students. Implemented a swipe to match mechanism in the React Native app and integrated ParseAPI to handle backend queries",
      "tags": "ReactNative ∙ ParseAPI",
      "link": "https://github.com/thetajwar2003/"
    },
    {
      "name": "AI Flappy Bird",
      "date": "06/09/2020",
      "meta": "An AI that learns and teaches itself the popular game Flappy Bird. It performed 48 generations, each with 60 Flappy Birds, before ending the simulation at 3 birds scoring 250 points.",
      "tags": "Python ∙ PyGame ∙ NEAT-python",
      "link": "https://github.com/thetajwar2003/AI-Flappy-Bird-"
    },
    {
      "name": "Google Assistant",
      "date": "04/08/20",
      "meta": "A voice assistant that would relay information about your inbox, events in your google calendar, youtube subscriptions, etc.",
      "tags": "Python ∙ Google APIs ∙ Automation",
      "link": "https://github.com/thetajwar2003/mini-google-assistant"
    }
  ],
  "education": [
    {
      "school": "The City College of New York (CUNY)",
      "graduation": "Expected: June 2024",
      "location": "New York City, NY",
      "info": ["B.S. in Computer Science", "Affiliations: ACM, NSBE, MSO, MGB"]
    },
    {
      "school": "The Bronx High School of Science",
      "graduation": "Sept 2017 - June 2021",
      "location": "Bronx, NY",
      "info": [
        "High School Diploma",
        "GPA: 3.9/4.0",
        "Vice President of the Machine Learning Club"
      ]
    }
  ]
}
